<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
        "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">
<head>
    <meta http-equiv="Content-Type" content="text/html;charset=UTF-8">
    <title>居间协议</title>
    <style>
        body{
            font-size: 16px;
            line-height: 36px;
            background: url("/images/Mediator/shuiyin.png") repeat;
        }
        p{
            line-height: 24px;
        }
    </style>
</head>
<body>
<h1 style="text-align: center;">居间协议</h1>
<div>
    <div style="float:left;width: 50%;">
        <p>委托人(简称甲方)：华安期货有限责任公司</p>
        <p>法定地址：合肥市长江中路419号</p>
        <p>邮    编：230061 </p>
        <p>电    话：4008820628</p>
    </div>
    <div style="float:left;">
        <p>居间人（简称乙方）：{{ $flow->info->name }}</p>
        <p>证件号码：{{ $flow->zjbh }}</p>
        <p>联系方式：{{ $flow->info->phone }}</p>
        <p>联系地址：{{ $flow->address }}</p>
        <p>职    业：{{ $flow->profession }}</p>
        <p>学    历：{{ $flow->edu_background }}</p>
        <p>资格证号： {{ $flow->exam_number }}</p>
    </div>
</div>
<div>
    <p>
        <h3>基本原则和术语定义</h3>
        （一）本协议由甲方、乙方本着诚实信用、平等互利的原则，经协商自愿签订。<br>
        （二）本协议所称委托人指委托居间人发现潜在期货投资者、促成期货经纪合同订立的当事人。<br>
        （三）本协议所称居间人指受期货公司或者客户的委托，为其提供订约的机会或者订立期货经纪合同的中间介绍服务，与期货公司签订居间协议，从事中间介绍行为，获取居间报酬，独立承担基于居间关系所产生的民事责任的自然人或法人。
    </p>

    <p>
        <h3>第一条  总则</h3>
        （一）乙方愿意以居间人身份，接受甲方委托为甲方提供与客户签约的机会或其他推广业务。<br>
        （二）甲方同意接受乙方上述申请及其提供的居间中间介绍服务。
    </p>

    <p>
        <h3>第二条  居间事项</h3>
        （一）乙方与甲方签订本协议后，甲方委托乙方推广甲方所经营的期货业务，向甲方推荐客户，并促成客户与甲方签订《期货经纪合同》。甲方有权根据国家规定及业务的需要对上述合同做出调整，无需事先通知乙方。<br>
        （二）乙方须接受甲方关于对客户资信等情况了解的要求，并予以协助。乙方应协助甲方对客户进行风险教育、知识培训和咨询服务等。
    </p>

    <p>
        <h3>第三条  双方的权利和义务</h3>
        （一）甲方的权利和义务：<br>
            1、甲方有权对乙方的真实合法身份进行核实，要求乙方提供相关的身份证明文件，居间协议到期续签的，甲方有权要求乙方重新提供身份证明文件。甲方根据有关管理规定对乙方的居间活动进行必要的监督管理，在新签居间协议时甲方有权对乙方进行知识测试及审核（详见知识测试附件、自律承诺附件）；<br>
            2、甲方有权督促乙方严格履行本协议的各项约定，并拥有对发生违约行为的乙方暂停、缓发或扣除部分或全部酬金、不予续约或立即终止协议的权利；<br>
            3、甲方对乙方介绍的客户进行身份审核、登记和分类管理，负责客户的期货开户、交易、结算、风险控制及保证金管理等事项；<br>
            4、甲方可为乙方提供必要的期货业务培训，进行必要的职业道德教育和风险教育。乙方未按甲方要求完成后续培训，甲方有权采取暂停、缓发或扣除部分或全部乙方居间返佣、不予续约或立即终止乙方居间协议的措施；<br>
            5、甲方按照法律法规扣除风险准备金、增值税及附加等相关税费后，依据本协议居间报酬附件约定的方式和比例计算出乙方应得的居间报酬，并在乙方提供增值税发票后予以支付（法人居间必须开具增值税专用发票，个人居间提供增值税普通发票及个税完税证明），对于不能提供发票和纳税证明的个人居间人，甲方有权依法为乙方代扣代缴个人所得税。发票种类随国家规定，甲方可做相应调整，乙方应按甲方要求执行。<br>
        <br>
        （二）乙方的权利和义务：<br>
            1、因从事居间活动付出的劳务，乙方有权按协议约定从甲方获取居间服务报酬；<br>
            2、乙方应忠实履行自己的中间介绍义务，积极促成符合期货交易适当性要求的投资者与甲方签订期货合同，不得阻挠或妨碍投资者与甲方的签约活动，不得损害投资者及甲方的合法权益；<br>
            3、乙方应向投资者如实告知自己的居间身份及职责，告知投资者甲方的情况、有关签订期货经纪合同的事项，告知投资者期货交易的功能和风险，不得故意隐瞒投资的风险或故意夸大投资的收益，不得做不实、误导的广告与宣传，不允许进行欺诈活动，不得隐瞒居间身份；<br>
            4、乙方应当通过适当方法了解投资者的风险偏好，并按照甲方期货投资者适当性及投资者教育工作要求，做好权限内的投资者服务工作；<br>
            5、乙方必须遵守国家法律法规和期货公司的相关规章制度，遵守《安徽省辖区期货经营机构居间业务自律规定》等自律管理规定，不得存在以下情形：<br>
            （1）以期货公司、期货公司下属机构或期货公司工作人员的名义开展经营活动；<br>
            （2）代理客户办理账户开立、销户、结算签字，或者资金存取、划转、查询等事宜；<br>
            （3）提供、传播虚假或者误导客户的信息，或者诱使客户进行不必要的期货买卖；<br>
            （4）接受客户委托，代理客户从事期货交易；<br>
            （5）代客操作或者代客理财；<br>
            （6）向客户承诺期货交易的损益；<br>
            （7）利用期货公司居间人身份变相非法集资或融资；<br>
            （8）为客户提供集中交易的场所，或以期货公司的名义设立经营服务网点；<br>
            （9）从事配资活动，向客户提供交易软件；<br>
            （10）有其他损害期货公司或客户利益的行为；<br>
            （11）有其他法律、法规或规范性文件禁止的行为。<br>
            6、乙方仅提供签订合同的信息或者机会，无权代理客户签订期货合同及其相关资料；不得作为其所介绍客户的指令下达人、结算单确认人和资金调拨人；不得代理客户办理与甲方相关的所有业务手续；<br>
            7、乙方应为甲方保守商业机密，为投资者保守商业秘密和个人隐私，不得泄露或传递给他人；<br>
            8、乙方与甲方签订居间协议后，方可开展居间业务，并据此行使有关权利，承担有关义务，接受有关制度的约束；<br>
            9、乙方自行承担介绍客户的居间活动费用。除按协议约定享有居间报酬外，乙方不得从甲方获取其他任何经济利益；<br>
            10、乙方促成客户与甲方签署期货经纪合同后，应按甲方规定的时间和程序进行居间客户关系申报，原则上应在客户开户的当月内提交归属申请，否则甲方将不予认定。乙方不得开发甲方现有客户；<br>
            11、乙方居间客户发生投诉，乙方应积极配合甲方妥善解决；<br>
            12、乙方承诺将甲方作为乙方在期货行业的唯一居间合作伙伴；<br>
            13、乙方应主动接受甲方的相关居间业务培训，每年参加后续培训应不少于10小时；<br>
            14、乙方应接受甲方以电话、短信或邮件等方式的回访业务；<br>
            15、乙方联系方式发生变化时应及时告知甲方并办理变更业务。
    </p>

    <p>
        <h3>第四条  居间报酬及支付方式</h3>
        详见居间报酬附件。
    </p>

    <p>
        <h3>第五条  保密事项</h3>
        （一）本协议任何条款和本协议所涉及的客户相关信息，以及客户签署的期货经纪合同等所有资料均属于保密信息，甲乙双方均负有保密义务。<br>
        （二）任何一方未经对方书面正式许可，不得以任何理由，在任何场合泄露、披露本协议任何条款及本协议所涉及的客户的任何资料。否则，守约一方有权追究对方的违约责任。
    </p>

    <p>
        <h3>第六条  其他事项</h3>
        （一）乙方并非甲方的员工或关联机构，不纳入甲方组织机构和劳动人事编制，仅为独立承担责任的主体。<br>
        （二）乙方签约前已阅读并完全了解本协议，乙方同意并愿意遵守。<br>
        （三）甲方可根据国家政策的要求及市场情况对公司规章制度等进行相应调整，乙方在此承诺接受并遵守。否则，本协议将自乙方提出异议时自动终止。<br>
        （四）提前解除本协议时，双方应结清因履行本协议产生的债权债务，否则双方仍应遵守本协议约定的义务。<br>
        （五）居间人当月居间报酬低于100元的，甲方不予以发放居间报酬。<br>
        （六）居间协议到期后乙方尚未办理居间协议续签手续的，甲方视同乙方放弃续签的权利，同时取消居间人原先开发的客户关系，并停止核发居间协议逾期后产生的报酬。乙方过期后再办理续签手续的视同为新签，所有流程参照新签居间协议标准办理，居间报酬自居间协议生效起计算，过往客户居间关系及居间报酬不予追溯。<br>
        （七）如乙方未能完成本协议期内的承诺指标，甲方在本协议续签时有权下调续签协议的留存返佣比例。<br>
        （八）乙方在本协议有效期内申请解除合同的，一年内不得重新签订合同。乙方更换所属部门的，居间返还比例一年内不得提高。
    </p>

    <p>
        <h3>第七条  违约责任</h3>
        （一）在履行本协议过程中，任何一方均应遵守本协议条款及甲方制定的规章制度，任何一方违约，守约方均可要求解除协议。<br>
        （二）如果甲方无故延期支付酬金超过30天，乙方有权解除本协议，并要求甲方立即支付到期的酬金及相关利息。<br>
        （三）如果乙方在签订居间协议后，从事任何违法、违规或违约的活动，均由乙方单独承担责任，甲方不承担任何连带责任，同时甲方拥有对乙方暂停、缓发或扣除部分或全部酬金、不予续约或立即终止协议的权利。如乙方违法、违规或违约行为给甲方造成损失的，乙方应当承担赔偿责任。<br>
        （四）居间客户发生投诉，乙方不能积极配合甲方妥善解决的，或因客户投诉给甲方带来不利影响，甲方有权对乙方暂停、缓发或扣除部分或全部酬金、不予续约或立即终止协议，给甲方造成损失的，乙方应当承担。
    </p>

    <p>
        <h3>第八条  争议的解决及管辖</h3>
        因本协议或履行本协议产生的纠纷，双方应友好协商。协商不成时，可向甲方所在地人民法院起诉。
    </p>

    <p>
        <h3>第九条  生效和有效期</h3>
        （一）本协议双方签字生效，一式两份，甲乙双方各执一份，协议附件与协议正文具有同等法律效力。<br>
        （二）本协议有效期为{{ date(' Y 年 m 月 d 日',strtotime($flow->xy_date_begin)) }}至{{ date(' Y 年 m 月 d 日',strtotime($flow->xy_date_end)) }}，期满双方同意可以续签。
    </p>
</div>
<div style="font-weight: bold;margin-top: 50px;">
    <div style="float:left;width: 50%;">
        <p>甲方：华安期货有限责任公司</p>
        <p>代表人签字：<img width="120" height="120" src="/images/Mediator/jiasign.jpg" alt=""></p>
        <p>日期：{{ date(' Y 年 m 月 d 日',strtotime($flow->xy_date_begin)) }}</p>
    </div>
    <div style="float:left;">
        <p>乙方：{{ $flow->info->name }}</p>
        <p>代表人签字：<img width="120" height="120" src="{{ $flow->base64_sign_img }}" alt=""></p>
        <p>日期：{{ date(' Y 年 m 月 d 日',strtotime($flow->part_b_date)) }}</p>
    </div>
</div>
</body>
</html>