<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
        "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">
<head>
    <meta http-equiv="Content-Type" content="text/html;charset=UTF-8">
    <title>居间业务测试</title>
</head>
<body>
    <h3>知识测试附件</h3>
    <h2 style="text-align: center;">居间业务测试</h2>
    <h3>单选</h3>
    <p>
        1.当发生客户纠纷时，居间人应当( C )<br/>
        A.告知客户该问题与自己无关<br/>
        B. 刻意隐瞒事实真相<br/>
        C. 配合期货公司解决纠纷<br/>
        D. 逃避、拒绝与期货公司、客户的联系<br/>
    </p>
    <p>
        2. 以下哪一项描述是错误的( D )<br/>
        A. 作为居间人不得向客户作获利保证或共担风险承诺<br/>
        B. 居间人应如实向客户介绍自己的真实身份<br/>
        C. 不得利用期货居间人身份变相非法集资或融资<br/>
        D. 居间人可以为客户提供集中交易场所，以期货公司名义设立经营服务网点<br/>
    </p>
    <p>
        3. 居间人应当如实告知客户从事期货交易风险和签署期货经纪合同的注意事项，不得故意隐瞒期货<span>(  )<span/>, <span>夸大( D ), <span/>不得通过虚假宣传引诱或者误导客户参与期货交易。<br/>
        A. 行情信息、投资风险<br/>
        B. 投资收益、投资风险<br/>
        C. 居间关系、投资收益<br/>
        D. 投资风险、投资收益<br/>
    </p>
    <p>
        4.居间人的下列哪种行为是正确的( A )<br/>
        A. 居间人为客户办理开户业务前告知其居间人身份<br/>
        B. 居间人代替客户签署期货经纪合同<br/>
        C. 居间人恶意诋毁期货公司某员工的名誉<br/>
        D. 居间人代理客户下单<br/>
    </p>
    <p>
        5.以下关于居间人与期货公司关系的说法，正确的是( C )<br/>
        A. 居间人可以是期货公司员工<br/>
        B. 居间人可以享受期货公司的工资、保险、福利和待遇<br/>
        C. 居间人与期货公司不存在雇佣劳动关系<br/>
        D. 居间人可以是期货公司的下属机构<br/>
    </p>
    <p>
        6.下列哪个选项不属于居间人在居间协议中的权利和义务( C )<br/>
        A. 居间人从事居间活动付出的劳务，有权按协议约定获取居间服务报酬<br/>
        B. 居间人在签订居间协议后，方可开展居间业务<br/>
        C.居间人为方便业务开发，以期货公司员工的身份开展经营活动<br/>
        D. 居间人应按要求提供合法合规的与居间报酬相一致的税务发票和纳税证明<br/>
    </p>
    <p>
        7.在下列情形中，居间人的做法错误的是( B )<br/>
        A.参加期货公司的居间业务培训<br/>
        B.向客户告知自己是期货公司分支机构，可以代理客户开户和交易<br/>
        C. 组织客户参加期货公司的投资报告会<br/>
        D. 为了解客户的风险承受能力，与客户多次沟通<br/>
    </p>
    <h3>判断题</h3>
    <p>
        8.居间人可以接受客户全权委托办理资金调拨和交易下单( x )
    </p>
    <p>
        9.居间人不得阻挠或妨碍投资者与期货公司的签约活动，不得损害投资者的合法权益。( √ )
    </p>
    <p>
        10.居间人应为期货公司保守商业机密，为投资者保守商业秘密和个人隐私，不得泄露或传递给他人。( √ )
    </p>
    <p>
        11.居间人应接受以期货公司电话、短信以及邮件等方式的回访业务。( √ )
    </p>
    <p>
        12.居间人可以在期货公司不知情的情况下，协助已开户的期货公司客户进行销户，让客户重新开户并归属到自己名下( x )
    </p>
    <div style="margin-top: 100px;">
        <div style="float:left;width: 50%;height: 10px;">

        </div>
        <div style="float:left;">
            <p>签字：<img width="120" height="120" src="{{ $flow->base64_sign_img }}" alt=""></p>
            <p>(机构加盖公章)：</p>
            <p>签署日期：{{ date(' Y 年 m 月 d 日',strtotime($flow->part_b_date)) }}</p>
        </div>
    </div>
</body>
</html>