<?php

return [

    /*
    |--------------------------------------------------------------------------
    | type 短信类型
    |--------------------------------------------------------------------------
    |
    |   默认短信平台 中正云（ZZY），优信（YX），腾讯（TX）
    |
    */

    'default' => 'ZZY',


    /*
    |--------------------------------------------------------------------------
    | 短信平台账户信息配置
    |--------------------------------------------------------------------------
    |
    | 短信地址，mult默认的短信发送接口地址
    | 短信账户、密码、状态码配置信息等
    | 
    |
    */
    'ZZY' => [
        'url' => [
            'mult' => 'http://service.winic.org:8009/sys_port/gateway/index.asp',
        ],
        'account' => 'haqh',
        'password' => 'haqh9772rjgcb',
        'status' => [
            '000' => '短信提交成功',
            '-01' => '账号余额不足',
            '-02' => '开通接口授权',
            '-03' => '账号密码错误',
            '-04' => '参数个数不对或者参数类型错误',
            '-110' => 'IP被限制	联系技术支持',
            '-12' => '其他错误'
        ],
    ],

    'YX' => [
        'url' => [
            'mult' => 'http://www.106551.com/ws/Send.aspx',
        ],
        'account' => 'YX03941',
        'password' => 'H@qhyx-956482',
        'status' => [
            '0' => '提交成功',
            '-1' => '账号未注册',
            '-2' => '其他错误',
            '-3' => '帐号或密码错误',
            '-4' => '手机号格式不对',
            '-5' => '余额不足，请先充值',
            '-6' => '定时发送时间不是有效的时间格式',
            '-8' => '发送内容需在1到500字之间',
            '-9' => '发送号码为空',
            '-10' => '定时时间不能小于当前系统时间',
            '-100' => '限制此IP访问',
            '-101' => '调用接口速度太快'
        ],
    ],


    'TX' => [
        'app_id' => env('QCLOUD_SMS_APP_ID',''),
        'app_key' => env('QCLOUD_SMS_APP_KEY',''),
        'smsSign' => env('QCLOUD_SMS_SIGN',''),
        'status' => [

        ],
    ],
];