<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 默认短信配置
    |--------------------------------------------------------------------------
    |
    |   [ strategy ] -- 默认的调用策略
    |           —— ——   OrderStrategy   顺序调用
    |           —— ——   RandomStrategy   随机调用
    |
    |   [ gateways ] -- 默认的网关，网关必须先在gateway下面继承interface
    |
    */
    'default' => [

        'strategy' => App\Services\Common\MSG\Strategies\OrderStrategy::class,

        'gateways' => [
            'MW', 'YX', 'ZZY'
        ],

    ],


    /*
    |--------------------------------------------------------------------------
    | 超时时间
    |--------------------------------------------------------------------------
    |
    */
    'timeout' => 5.0,


    /*
    |--------------------------------------------------------------------------
    | debug
    |--------------------------------------------------------------------------
    |   调试模式，将打印到log
    */
    'debug' => false,


    /*
    |--------------------------------------------------------------------------
    | 日志类型
    |--------------------------------------------------------------------------
    |   [ file ] -- 文件日志系统log，
    |   [ db ] -- 数据库日志
    */
    'logType' => 'db',


    /*
    |--------------------------------------------------------------------------
    | 异常发生时需要通知到的用户 类型为角色
    |--------------------------------------------------------------------------
    |
    */
    'errNotify_to_role' => 'smsManager',


    /*
    |--------------------------------------------------------------------------
    | 短信平台账户信息配置
    |--------------------------------------------------------------------------
    |
    | 短信地址，mult默认的短信发送接口地址
    | 短信账户、密码、状态码配置信息等
    | 
    |
    */
    'gateways' => [
        'log' => [
            'type' => 'db',
//            'filePath' => '/tmp/sms.log', //未实现，勿开启 TODO
        ],

        //中证云
        'ZZY' => [
            'name' => '中证云',
            'base_uri' => 'http://service.winic.org:8009/sys_port/gateway/index.asp',
            'account' => 'haqh',
            'password' => 'haqh9772rjgcb',
            'status' => [
                '000' => '短信提交成功',
                '-01' => '账号余额不足',
                '-02' => '开通接口授权',
                '-03' => '账号密码错误',
                '-04' => '参数个数不对或者参数类型错误',
                '-110' => 'IP被限制,联系技术支持',
                '-12' => '其他错误'
            ],
        ],

        //优信
        'YX' => [
            'name' => '优信',
            'base_uri' => 'http://www.106551.com/ws/Send.aspx',
            'account' => 'YX03941',
            'password' => 'H@qhyx-956482',
            'status' => [
                '0' => '提交成功',
                '-1' => '账号未注册',
                '-2' => '其他错误',
                '-3' => '帐号或密码错误',
                '-4' => '手机号格式不对',
                '-5' => '余额不足，请先充值',
                '-6' => '定时发送时间不是有效的时间格式',
                '-8' => '发送内容需在1到500字之间',
                '-9' => '发送号码为空',
                '-10' => '定时时间不能小于当前系统时间',
                '-100' => '限制此IP访问',
                '-101' => '调用接口速度太快'
            ],
        ],

        //腾讯
        'TX' => [
            'name' => '腾讯',
            'base_uri' => 'https://yun.tim.qq.com/v5/',
            'app_id' => '1400152948',
            'app_key' => 'dae1ed069ae9df945ba09fd44be7da92',
            'smsSign' => '华安期货',
            'status' => [

            ],
        ],

        //梦网 - 客服账号，以及其他功能接入账号
        'MW-KF' => [
            'name' => '梦网-客服',
            'base_uri' => 'http://TSN19.800CT.COM:8901/sms/v2/std/',
            'account' => 'JJ2706',
            'password' => '775599',
            'mode' => 2,    //加密模式，1明文，2 MD5加密
            'status' => [
                '0' => '发送成功！',
                '-100001' => '鉴权不通过,请检查账号,密码,时间戳,固定串,以及MD5算法是否按照文档要求进行设置',
                '-100002' => '用户多次鉴权不通过,请检查账号,密码,时间戳,固定串,以及MD5算法是否按照文档要求进行设置',
                '-100003' => '用户欠费',
                '-100004' => 'custid或者exdata字段填写不合法',
                '-100011' => '短信内容超长',
                '-100012' => '手机号码不合法',
                '-100014' => '手机号码超过最大支持数量（1000）',
                '-100029' => '端口绑定失败',
                '-100056' => '用户账号登录的连接数超限',
                '-100057' => '用户账号登录的IP错误',
                '-100126' => '短信有效存活时间无效',
                '-100252' => '业务类型不合法(超长或包含非字母数字字符)',
                '-100253' => '自定义参数超长',
                '-100999' => '平台数据库内部错误'
            ],
        ],

        //梦网 - 仅交易相关账号
        'MW-JY' => [
            'name' => '梦网-客服',
            'base_uri' => 'http://TSN19.800CT.COM:8901/sms/v2/std/',
            'account' => 'JJ2843',
            'password' => '852663',
            'mode' => 2,    //加密模式，1明文，2 MD5加密
            'status' => [
                '0' => '发送成功！',
                '-100001' => '鉴权不通过,请检查账号,密码,时间戳,固定串,以及MD5算法是否按照文档要求进行设置',
                '-100002' => '用户多次鉴权不通过,请检查账号,密码,时间戳,固定串,以及MD5算法是否按照文档要求进行设置',
                '-100003' => '用户欠费',
                '-100004' => 'custid或者exdata字段填写不合法',
                '-100011' => '短信内容超长',
                '-100012' => '手机号码不合法',
                '-100014' => '手机号码超过最大支持数量（1000）',
                '-100029' => '端口绑定失败',
                '-100056' => '用户账号登录的连接数超限',
                '-100057' => '用户账号登录的IP错误',
                '-100126' => '短信有效存活时间无效',
                '-100252' => '业务类型不合法(超长或包含非字母数字字符)',
                '-100253' => '自定义参数超长',
                '-100999' => '平台数据库内部错误'
            ],
        ],
    ]
];