<?php

return [

    /*
    |--------------------------------------------------------------------------
    | type 短信类型
    |--------------------------------------------------------------------------
    |
    |   默认短信平台 中正云（ZZY），优信（YX），腾讯（TX）， 梦网（MW）
    |
    */

    'default' => 'TX',


    /*
    |--------------------------------------------------------------------------
    | type 短信类型 -- ！！必须大写！！
    |--------------------------------------------------------------------------
    |
    |   短信平台列表 中正云（ZZY），优信（YX），腾讯（TX）， 梦网（MW）
    |
    */

    'list' => [
        'ZZY',
        'YX',
        'TX',
        'MW'
    ],


    /*
    |--------------------------------------------------------------------------
    | 短信平台账户信息配置
    |--------------------------------------------------------------------------
    |
    | 短信地址，mult默认的短信发送接口地址
    | 短信账户、密码、状态码配置信息等
    | 
    |
    */
    'ZZY' => [
        'url' => [
            'mult' => 'http://service.winic.org:8009/sys_port/gateway/index.asp',
        ],
        'account' => 'haqh',
        'password' => 'haqh9772rjgcb',
        'status' => [
            '000' => '短信提交成功',
            '-01' => '账号余额不足',
            '-02' => '开通接口授权',
            '-03' => '账号密码错误',
            '-04' => '参数个数不对或者参数类型错误',
            '-110' => 'IP被限制	联系技术支持',
            '-12' => '其他错误'
        ],
    ],

    'YX' => [
        'url' => [
            'mult' => 'http://www.106551.com/ws/Send.aspx',
        ],
        'account' => 'YX03941',
        'password' => 'H@qhyx-956482',
        'status' => [
            '0' => '提交成功',
            '-1' => '账号未注册',
            '-2' => '其他错误',
            '-3' => '帐号或密码错误',
            '-4' => '手机号格式不对',
            '-5' => '余额不足，请先充值',
            '-6' => '定时发送时间不是有效的时间格式',
            '-8' => '发送内容需在1到500字之间',
            '-9' => '发送号码为空',
            '-10' => '定时时间不能小于当前系统时间',
            '-100' => '限制此IP访问',
            '-101' => '调用接口速度太快'
        ],
    ],


    'TX' => [
        'app_id' => env('QCLOUD_SMS_APP_ID',''),
        'app_key' => env('QCLOUD_SMS_APP_KEY',''),
        'smsSign' => env('QCLOUD_SMS_SIGN',''),
        'status' => [

        ],
    ],

    'MW' => [
        'debug' => false,   //调试模式，将打印到log
        'url' => [
            'mult' => 'http://TSN19.800CT.COM:8901/sms/v2/std/',
        ],
        'account' => 'JJ2706',
        'password' => '775599',
        'mode' => 2,    //加密模式，1明文，2 MD5加密
        'status' => [
            '-100001' => '鉴权不通过,请检查账号,密码,时间戳,固定串,以及MD5算法是否按照文档要求进行设置',
            '-100002' => '用户多次鉴权不通过,请检查账号,密码,时间戳,固定串,以及MD5算法是否按照文档要求进行设置',
            '-100003' => '用户欠费',
            '-100004' => 'custid或者exdata字段填写不合法',
            '-100011' => '短信内容超长',
            '-100012' => '手机号码不合法',
            '-100014' => '手机号码超过最大支持数量（1000）',
            '-100029' => '端口绑定失败',
            '-100056' => '用户账号登录的连接数超限',
            '-100057' => '用户账号登录的IP错误',
            '-100126' => '短信有效存活时间无效',
            '-100252' => '业务类型不合法(超长或包含非字母数字字符)',
            '-100253' => '自定义参数超长',
            '-100999' => '平台数据库内部错误'
        ],
    ],
];